p = [
    [' ', "1", "2", "3"],
    ["1", "-", "-", "-"],
    ["2", "-", "-", "-"],
    ["3", "-", "-", "-"]
]
#вывод поля
def print_field():
    for a in range(4):
        print(' '.join(p[a]))


#проверка условия
def check_win():
    for v in range(1, 4):
        if p[v][1] == p[v][2] == p[v][3] == "x":
            print("ТЫ победил этот скучный мир! Х, да прибудет с тобой сила!")
            exit(0)
        elif p[v][1] == p[v][2] == p[v][3] == "o":
            print("ТЫ победил этот скучный мир! O, да прибудет с тобой сила!")
            exit(0)

    for h in range(1, 4):
        if p[1][h] == p[2][h] == p[3][h] == "x":
            print("ТЫ победил этот скучный мир! Х, да прибудет с тобой сила!")
            exit(0)
        elif p[1][h] == p[2][h] == p[3][h] == "o":
            print("ТЫ победил этот скучный мир! O, да прибудет с тобой сила!")
            exit(0)

    if p[1][1] == p[2][2] == p[3][3] == "x":
        print("ТЫ победил этот скучный мир! Х, да прибудет с тобой сила!")
        exit(0)

    if p[1][3] == p[2][2] == p[3][1] == "x":
        print("ТЫ победил этот скучный мир! O, да прибудет с тобой сила!")
        exit(0)

    if p[1][1] == p[2][2] == p[3][3] == "o":
        print("ТЫ победил этот скучный мир! O, да прибудет с тобой сила!")
        exit(0)

    if p[1][3] == p[2][2] == p[3][1] == "o":
        print("ТЫ победил этот скучный мир! Х, да прибудет с тобой сила!")
        exit(0)

#принятие хода x
def cross():
    no_move = True
    while no_move:
        x = int(input("X введите строку:"))
        y = int(input("X введите ряд:"))
        if x < 4 > y:
            z = p[x]
            if z[y] == "-":
                z[y] = "x"
                no_move = False
        else:
            print("Не шали!")

# принятие хода O
def zero():
    no_move = True
    while no_move:
        x = int(input("O введите строку:"))
        y = int(input("O введите ряд:"))
        if x < 4 > y:
            z = p[x]
            if z[y] == "-":
                z[y] = "o"
                no_move = False
        else:
            print("Не шали!")

print_field()

for t in range (0, 9):
    print("---> Ход", t)
    #принятие хода x
    if t % 2 == 0:
        cross()
    else:
        zero()

    # Вывод поля
    print_field()

    # Проверка на выигрыш
    check_win()

print("НИЧЬЯ! БАЛАНС В СИЛЕ!")